package codewars.homework;

public class Matrix {
	
//	- создание из 2-х мерного массива
	public int[][] matrixFromArray(int... array) {

		return null;
	}
	
	
//	- создание из существующей матрицы
	
//	- создание нулевой матрицы заданной размерности
	
//	- получение размерности
	public int matrixSize(int... array) {
		return 0;
	}
	
//	- сложение матриц
	
//	- умножение матриц
	
//	- умножеие матрицы на число
	
//	- умножеие матрицы на вектор соответствующей размерности
	
//	- вывод матрицы в виде таблицы при вызове writeLine(matrix)
//	[1,2,3]
//	[4,5,6]


}
